Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ0512EFF100.atdf
         <register caption="ADC Global Interrupt Enable Register 2" name="ADCGIRQEN2" offset="0x24" rw="RW" size="4">
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 32" mask="0x00000001" name="AGIEN32" values="ADCGIRQEN2__AGIEN32"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 33" mask="0x00000002" name="AGIEN33" values="ADCGIRQEN2__AGIEN33"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 34" mask="0x00000004" name="AGIEN34" values="ADCGIRQEN2__AGIEN34"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 35" mask="0x00000008" name="AGIEN35" values="ADCGIRQEN2__AGIEN35"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 36" mask="0x00000010" name="AGIEN36" values="ADCGIRQEN2__AGIEN36"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 37" mask="0x00000020" name="AGIEN37" values="ADCGIRQEN2__AGIEN37"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 38" mask="0x00000040" name="AGIEN38" values="ADCGIRQEN2__AGIEN38"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 39" mask="0x00000080" name="AGIEN39" values="ADCGIRQEN2__AGIEN39"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 40" mask="0x00000100" name="AGIEN40" values="ADCGIRQEN2__AGIEN40"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 41" mask="0x00000200" name="AGIEN41" values="ADCGIRQEN2__AGIEN41"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 42" mask="0x00000400" name="AGIEN42" values="ADCGIRQEN2__AGIEN42"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 43" mask="0x00000800" name="AGIEN43" values="ADCGIRQEN2__AGIEN43"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 44" mask="0x00001000" name="AGIEN44" values="ADCGIRQEN2__AGIEN44"/>
            <bitfield mask="0x00002000" name="AGIEN45"/>
            <bitfield mask="0x00004000" name="AGIEN46"/>
            <bitfield mask="0x00008000" name="AGIEN47"/>
            <bitfield mask="0x00010000" name="AGIEN48"/>
            <bitfield mask="0x00020000" name="AGIEN49"/>
            <bitfield mask="0x00040000" name="AGIEN50"/>
            <bitfield mask="0x00080000" name="AGIEN51"/>
            <bitfield mask="0x00100000" name="AGIEN52"/>
            <bitfield mask="0x00200000" name="AGIEN53"/>
            <bitfield mask="0x00400000" name="AGIEN54"/>
            <bitfield mask="0x00800000" name="AGIEN55"/>
            <bitfield mask="0x01000000" name="AGIEN56"/>
            <bitfield mask="0x02000000" name="AGIEN57"/>
            <bitfield mask="0x04000000" name="AGIEN58"/>
            <bitfield mask="0x08000000" name="AGIEN59"/>
            <bitfield mask="0x10000000" name="AGIEN60"/>
            <bitfield mask="0x20000000" name="AGIEN61"/>
            <bitfield mask="0x40000000" name="AGIEN62"/>
            <bitfield mask="0x80000000" name="AGIEN63"/>
         </register>
         <register caption="ADC Common Scan Select Register 1" name="ADCCSS1" offset="0x28" rw="RW" size="4">
            <bitfield caption="Analog Common Scan Select bits 0" mask="0x00000001" name="CSS0" values="ADCCSS1__CSS0"/>
            <bitfield caption="Analog Common Scan Select bits 1" mask="0x00000002" name="CSS1" values="ADCCSS1__CSS1"/>
            <bitfield caption="Analog Common Scan Select bits 2" mask="0x00000004" name="CSS2" values="ADCCSS1__CSS2"/>
            <bitfield caption="Analog Common Scan Select bits 3" mask="0x00000008" name="CSS3" values="ADCCSS1__CSS3"/>
            <bitfield caption="Analog Common Scan Select bits 4" mask="0x00000010" name="CSS4" values="ADCCSS1__CSS4"/>
            <bitfield caption="Analog Common Scan Select bits 5" mask="0x00000020" name="CSS5" values="ADCCSS1__CSS5"/>
            <bitfield caption="Analog Common Scan Select bits 6" mask="0x00000040" name="CSS6" values="ADCCSS1__CSS6"/>
            <bitfield caption="Analog Common Scan Select bits 7" mask="0x00000080" name="CSS7" values="ADCCSS1__CSS7"/>
            <bitfield caption="Analog Common Scan Select bits 8" mask="0x00000100" name="CSS8" values="ADCCSS1__CSS8"/>
            <bitfield caption="Analog Common Scan Select bits 9" mask="0x00000200" name="CSS9" values="ADCCSS1__CSS9"/>
            <bitfield caption="Analog Common Scan Select bits 10" mask="0x00000400" name="CSS10" values="ADCCSS1__CSS10"/>
            <bitfield caption="Analog Common Scan Select bits 11" mask="0x00000800" name="CSS11" values="ADCCSS1__CSS11"/>
            <bitfield caption="Analog Common Scan Select bits 12" mask="0x00001000" name="CSS12" values="ADCCSS1__CSS12"/>
            <bitfield caption="Analog Common Scan Select bits 13" mask="0x00002000" name="CSS13" values="ADCCSS1__CSS13"/>
            <bitfield caption="Analog Common Scan Select bits 14" mask="0x00004000" name="CSS14" values="ADCCSS1__CSS14"/>
            <bitfield caption="Analog Common Scan Select bits 15" mask="0x00008000" name="CSS15" values="ADCCSS1__CSS15"/>
            <bitfield caption="Analog Common Scan Select bits 16" mask="0x00010000" name="CSS16" values="ADCCSS1__CSS16"/>
            <bitfield caption="Analog Common Scan Select bits 17" mask="0x00020000" name="CSS17" values="ADCCSS1__CSS17"/>
            <bitfield caption="Analog Common Scan Select bits 18" mask="0x00040000" name="CSS18" values="ADCCSS1__CSS18"/>
            <bitfield caption="Analog Common Scan Select bits 19" mask="0x00080000" name="CSS19" values="ADCCSS1__CSS19"/>
            <bitfield caption="Analog Common Scan Select bits 20" mask="0x00100000" name="CSS20" values="ADCCSS1__CSS20"/>
            <bitfield caption="Analog Common Scan Select bits 21" mask="0x00200000" name="CSS21" values="ADCCSS1__CSS21"/>
            <bitfield caption="Analog Common Scan Select bits 22" mask="0x00400000" name="CSS22" values="ADCCSS1__CSS22"/>
            <bitfield caption="Analog Common Scan Select bits 23" mask="0x00800000" name="CSS23" values="ADCCSS1__CSS23"/>
            <bitfield caption="Analog Common Scan Select bits 24" mask="0x01000000" name="CSS24" values="ADCCSS1__CSS24"/>
            <bitfield caption="Analog Common Scan Select bits 25" mask="0x02000000" name="CSS25" values="ADCCSS1__CSS25"/>
            <bitfield caption="Analog Common Scan Select bits 26" mask="0x04000000" name="CSS26" values="ADCCSS1__CSS26"/>
            <bitfield caption="Analog Common Scan Select bits 27" mask="0x08000000" name="CSS27" values="ADCCSS1__CSS27"/>
            <bitfield caption="Analog Common Scan Select bits 28" mask="0x10000000" name="CSS28" values="ADCCSS1__CSS28"/>
            <bitfield caption="Analog Common Scan Select bits 29" mask="0x20000000" name="CSS29" values="ADCCSS1__CSS29"/>
            <bitfield caption="Analog Common Scan Select bits 30" mask="0x40000000" name="CSS30" values="ADCCSS1__CSS30"/>
            <bitfield caption="Analog Common Scan Select bits 31" mask="0x80000000" name="CSS31" values="ADCCSS1__CSS31"/>
         </register>
         <register caption="ADC Common Scan Select Register 2" name="ADCCSS2" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CSS32"/>
            <bitfield caption="Analog Common Scan Select bits 33" mask="0x00000002" name="CSS33" values="ADCCSS2__CSS33"/>
            <bitfield caption="Analog Common Scan Select bits 34" mask="0x00000004" name="CSS34" values="ADCCSS2__CSS34"/>
            <bitfield caption="Analog Common Scan Select bits 35" mask="0x00000008" name="CSS35" values="ADCCSS2__CSS35"/>
            <bitfield caption="Analog Common Scan Select bits 36" mask="0x00000010" name="CSS36" values="ADCCSS2__CSS36"/>
            <bitfield caption="Analog Common Scan Select bits 37" mask="0x00000020" name="CSS37" values="ADCCSS2__CSS37"/>
            <bitfield caption="Analog Common Scan Select bits 38" mask="0x00000040" name="CSS38" values="ADCCSS2__CSS38"/>
            <bitfield caption="Analog Common Scan Select bits 39" mask="0x00000080" name="CSS39" values="ADCCSS2__CSS39"/>
            <bitfield caption="Analog Common Scan Select bits 40" mask="0x00000100" name="CSS40" values="ADCCSS2__CSS40"/>
            <bitfield caption="Analog Common Scan Select bits 41" mask="0x00000200" name="CSS41" values="ADCCSS2__CSS41"/>
            <bitfield caption="Analog Common Scan Select bits 42" mask="0x00000400" name="CSS42" values="ADCCSS2__CSS42"/>
            <bitfield caption="Analog Common Scan Select bits 43" mask="0x00000800" name="CSS43" values="ADCCSS2__CSS43"/>
            <bitfield caption="Analog Common Scan Select bits 44" mask="0x00001000" name="CSS44" values="ADCCSS2__CSS44"/>
            <bitfield mask="0x00002000" name="CSS45"/>
            <bitfield mask="0x00004000" name="CSS46"/>
            <bitfield mask="0x00008000" name="CSS47"/>
            <bitfield mask="0x00010000" name="CSS48"/>
            <bitfield mask="0x00020000" name="CSS49"/>
            <bitfield mask="0x00040000" name="CSS50"/>
            <bitfield mask="0x00080000" name="CSS51"/>
            <bitfield mask="0x00100000" name="CSS52"/>
            <bitfield mask="0x00200000" name="CSS53"/>
            <bitfield mask="0x00400000" name="CSS54"/>
            <bitfield mask="0x00800000" name="CSS55"/>
            <bitfield mask="0x01000000" name="CSS56"/>
            <bitfield mask="0x02000000" name="CSS57"/>
            <bitfield mask="0x04000000" name="CSS58"/>
            <bitfield mask="0x08000000" name="CSS59"/>
            <bitfield mask="0x10000000" name="CSS60"/>
            <bitfield mask="0x20000000" name="CSS61"/>
            <bitfield mask="0x40000000" name="CSS62"/>
            <bitfield mask="0x80000000" name="CSS63"/>
         </register>
         <register caption="ADC Data Ready Status Register 1" name="ADCDSTAT1" offset="0x30" rw="R" size="4">
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 0" mask="0x00000001" name="ARDY0" values="ADCDSTAT1__ARDY0"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 1" mask="0x00000002" name="ARDY1" values="ADCDSTAT1__ARDY1"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 2" mask="0x00000004" name="ARDY2" values="ADCDSTAT1__ARDY2"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 3" mask="0x00000008" name="ARDY3" values="ADCDSTAT1__ARDY3"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 4" mask="0x00000010" name="ARDY4" values="ADCDSTAT1__ARDY4"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 5" mask="0x00000020" name="ARDY5" values="ADCDSTAT1__ARDY5"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 6" mask="0x00000040" name="ARDY6" values="ADCDSTAT1__ARDY6"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 7" mask="0x00000080" name="ARDY7" values="ADCDSTAT1__ARDY7"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 8" mask="0x00000100" name="ARDY8" values="ADCDSTAT1__ARDY8"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 9" mask="0x00000200" name="ARDY9" values="ADCDSTAT1__ARDY9"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 10" mask="0x00000400" name="ARDY10" values="ADCDSTAT1__ARDY10"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 11" mask="0x00000800" name="ARDY11" values="ADCDSTAT1__ARDY11"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 12" mask="0x00001000" name="ARDY12" values="ADCDSTAT1__ARDY12"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 13" mask="0x00002000" name="ARDY13" values="ADCDSTAT1__ARDY13"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 14" mask="0x00004000" name="ARDY14" values="ADCDSTAT1__ARDY14"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 15" mask="0x00008000" name="ARDY15" values="ADCDSTAT1__ARDY15"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 16" mask="0x00010000" name="ARDY16" values="ADCDSTAT1__ARDY16"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 17" mask="0x00020000" name="ARDY17" values="ADCDSTAT1__ARDY17"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 18" mask="0x00040000" name="ARDY18" values="ADCDSTAT1__ARDY18"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 19" mask="0x00080000" name="ARDY19" values="ADCDSTAT1__ARDY19"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 20" mask="0x00100000" name="ARDY20" values="ADCDSTAT1__ARDY20"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 21" mask="0x00200000" name="ARDY21" values="ADCDSTAT1__ARDY21"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 22" mask="0x00400000" name="ARDY22" values="ADCDSTAT1__ARDY22"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 23" mask="0x00800000" name="ARDY23" values="ADCDSTAT1__ARDY23"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 24" mask="0x01000000" name="ARDY24" values="ADCDSTAT1__ARDY24"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 25" mask="0x02000000" name="ARDY25" values="ADCDSTAT1__ARDY25"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 26" mask="0x04000000" name="ARDY26" values="ADCDSTAT1__ARDY26"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 27" mask="0x08000000" name="ARDY27" values="ADCDSTAT1__ARDY27"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 28" mask="0x10000000" name="ARDY28" values="ADCDSTAT1__ARDY28"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 29" mask="0x20000000" name="ARDY29" values="ADCDSTAT1__ARDY29"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 30" mask="0x40000000" name="ARDY30" values="ADCDSTAT1__ARDY30"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 31" mask="0x80000000" name="ARDY31" values="ADCDSTAT1__ARDY31"/>
         </register>
         <register caption="ADC Data Ready Status Register 2" name="ADCDSTAT2" offset="0x34" rw="R" size="4">
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 32" mask="0x00000001" name="ARDY32" values="ADCDSTAT2__ARDY32"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 33" mask="0x00000002" name="ARDY33" values="ADCDSTAT2__ARDY33"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 34" mask="0x00000004" name="ARDY34" values="ADCDSTAT2__ARDY34"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 35" mask="0x00000008" name="ARDY35" values="ADCDSTAT2__ARDY35"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 36" mask="0x00000010" name="ARDY36" values="ADCDSTAT2__ARDY36"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 37" mask="0x00000020" name="ARDY37" values="ADCDSTAT2__ARDY37"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 38" mask="0x00000040" name="ARDY38" values="ADCDSTAT2__ARDY38"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 39" mask="0x00000080" name="ARDY39" values="ADCDSTAT2__ARDY39"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 40" mask="0x00000100" name="ARDY40" values="ADCDSTAT2__ARDY40"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 41" mask="0x00000200" name="ARDY41" values="ADCDSTAT2__ARDY41"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 42" mask="0x00000400" name="ARDY42" values="ADCDSTAT2__ARDY42"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 43" mask="0x00000800" name="ARDY43" values="ADCDSTAT2__ARDY43"/>
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bit 44" mask="0x00001000" name="ARDY44" values="ADCDSTAT2__ARDY44"/>
            <bitfield mask="0x00002000" name="ARDY45"/>
            <bitfield mask="0x00004000" name="ARDY46"/>
            <bitfield mask="0x00008000" name="ARDY47"/>
            <bitfield mask="0x00010000" name="ARDY48"/>
            <bitfield mask="0x00020000" name="ARDY49"/>
            <bitfield mask="0x00040000" name="ARDY50"/>
            <bitfield mask="0x00080000" name="ARDY51"/>
            <bitfield mask="0x00100000" name="ARDY52"/>
            <bitfield mask="0x00200000" name="ARDY53"/>
            <bitfield mask="0x00400000" name="ARDY54"/>
            <bitfield mask="0x00800000" name="ARDY55"/>
            <bitfield mask="0x01000000" name="ARDY56"/>
            <bitfield mask="0x02000000" name="ARDY57"/>
            <bitfield mask="0x04000000" name="ARDY58"/>
            <bitfield mask="0x08000000" name="ARDY59"/>
            <bitfield mask="0x10000000" name="ARDY60"/>
            <bitfield mask="0x20000000" name="ARDY61"/>
            <bitfield mask="0x40000000" name="ARDY62"/>
            <bitfield mask="0x80000000" name="ARDY63"/>
         </register>
         <register caption="ADC Digital Comparator x Enable Register (x = 1 through 6)" name="ADCCMPEN1" offset="0x38" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMPE0"/>
            <bitfield mask="0x00000002" name="CMPE1"/>
            <bitfield mask="0x00000004" name="CMPE2"/>
            <bitfield mask="0x00000008" name="CMPE3"/>
            <bitfield mask="0x00000010" name="CMPE4"/>
            <bitfield mask="0x00000020" name="CMPE5"/>
            <bitfield mask="0x00000040" name="CMPE6"/>
            <bitfield mask="0x00000080" name="CMPE7"/>
            <bitfield mask="0x00000100" name="CMPE8"/>
            <bitfield mask="0x00000200" name="CMPE9"/>
            <bitfield mask="0x00000400" name="CMPE10"/>
            <bitfield mask="0x00000800" name="CMPE11"/>
            <bitfield mask="0x00001000" name="CMPE12"/>
            <bitfield mask="0x00002000" name="CMPE13"/>
            <bitfield mask="0x00004000" name="CMPE14"/>
            <bitfield mask="0x00008000" name="CMPE15"/>
            <bitfield mask="0x00010000" name="CMPE16"/>
            <bitfield mask="0x00020000" name="CMPE17"/>
            <bitfield mask="0x00040000" name="CMPE18"/>
            <bitfield mask="0x00080000" name="CMPE19"/>
            <bitfield mask="0x00100000" name="CMPE20"/>
            <bitfield mask="0x00200000" name="CMPE21"/>
            <bitfield mask="0x00400000" name="CMPE22"/>
            <bitfield mask="0x00800000" name="CMPE23"/>
            <bitfield mask="0x01000000" name="CMPE24"/>
            <bitfield mask="0x02000000" name="CMPE25"/>
            <bitfield mask="0x04000000" name="CMPE26"/>
            <bitfield mask="0x08000000" name="CMPE27"/>
            <bitfield mask="0x10000000" name="CMPE28"/>
            <bitfield mask="0x20000000" name="CMPE29"/>
            <bitfield mask="0x40000000" name="CMPE30"/>
            <bitfield mask="0x80000000" name="CMPE31"/>
         </register>
         <register caption="ADC Digital Comparator x Enable Register (x = 1 through 6)" name="ADCCMPEN2" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMPE0"/>
            <bitfield mask="0x00000002" name="CMPE1"/>
            <bitfield mask="0x00000004" name="CMPE2"/>
            <bitfield mask="0x00000008" name="CMPE3"/>
            <bitfield mask="0x00000010" name="CMPE4"/>
            <bitfield mask="0x00000020" name="CMPE5"/>
            <bitfield mask="0x00000040" name="CMPE6"/>
            <bitfield mask="0x00000080" name="CMPE7"/>
            <bitfield mask="0x00000100" name="CMPE8"/>
            <bitfield mask="0x00000200" name="CMPE9"/>
            <bitfield mask="0x00000400" name="CMPE10"/>
            <bitfield mask="0x00000800" name="CMPE11"/>
            <bitfield mask="0x00001000" name="CMPE12"/>
            <bitfield mask="0x00002000" name="CMPE13"/>
            <bitfield mask="0x00004000" name="CMPE14"/>
            <bitfield mask="0x00008000" name="CMPE15"/>
            <bitfield mask="0x00010000" name="CMPE16"/>
            <bitfield mask="0x00020000" name="CMPE17"/>
            <bitfield mask="0x00040000" name="CMPE18"/>
            <bitfield mask="0x00080000" name="CMPE19"/>
            <bitfield mask="0x00100000" name="CMPE20"/>
            <bitfield mask="0x00200000" name="CMPE21"/>
            <bitfield mask="0x00400000" name="CMPE22"/>
            <bitfield mask="0x00800000" name="CMPE23"/>
            <bitfield mask="0x01000000" name="CMPE24"/>
            <bitfield mask="0x02000000" name="CMPE25"/>
            <bitfield mask="0x04000000" name="CMPE26"/>
            <bitfield mask="0x08000000" name="CMPE27"/>
            <bitfield mask="0x10000000" name="CMPE28"/>
            <bitfield mask="0x20000000" name="CMPE29"/>
            <bitfield mask="0x40000000" name="CMPE30"/>
            <bitfield mask="0x80000000" name="CMPE31"/>
         </register>
