Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ0512EFF100.atdf
         <register caption="" name="PORTA" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RA0"/>
            <bitfield mask="0x00000002" name="RA1"/>
            <bitfield mask="0x00000004" name="RA2"/>
            <bitfield mask="0x00000008" name="RA3"/>
            <bitfield mask="0x00000010" name="RA4"/>
            <bitfield mask="0x00000020" name="RA5"/>
            <bitfield mask="0x00000040" name="RA6"/>
            <bitfield mask="0x00000080" name="RA7"/>
            <bitfield mask="0x00000100" name="RA8"/>
            <bitfield mask="0x00000200" name="RA9"/>
            <bitfield mask="0x00000400" name="RA10"/>
            <bitfield mask="0x00000800" name="RA11"/>
            <bitfield mask="0x00001000" name="RA12"/>
            <bitfield mask="0x00002000" name="RA13"/>
            <bitfield mask="0x00004000" name="RA14"/>
            <bitfield mask="0x00008000" name="RA15"/>
         </register>
         <register caption="" name="PORTB" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RB0"/>
            <bitfield mask="0x00000002" name="RB1"/>
            <bitfield mask="0x00000004" name="RB2"/>
            <bitfield mask="0x00000008" name="RB3"/>
            <bitfield mask="0x00000010" name="RB4"/>
            <bitfield mask="0x00000020" name="RB5"/>
            <bitfield mask="0x00000040" name="RB6"/>
            <bitfield mask="0x00000080" name="RB7"/>
            <bitfield mask="0x00000100" name="RB8"/>
            <bitfield mask="0x00000200" name="RB9"/>
            <bitfield mask="0x00000400" name="RB10"/>
            <bitfield mask="0x00000800" name="RB11"/>
            <bitfield mask="0x00001000" name="RB12"/>
            <bitfield mask="0x00002000" name="RB13"/>
            <bitfield mask="0x00004000" name="RB14"/>
            <bitfield mask="0x00008000" name="RB15"/>
         </register>
         <register caption="" name="PORTC" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RC0"/>
            <bitfield mask="0x00000002" name="RC1"/>
            <bitfield mask="0x00000004" name="RC2"/>
            <bitfield mask="0x00000008" name="RC3"/>
            <bitfield mask="0x00000010" name="RC4"/>
            <bitfield mask="0x00000020" name="RC5"/>
            <bitfield mask="0x00000040" name="RC6"/>
            <bitfield mask="0x00000080" name="RC7"/>
            <bitfield mask="0x00000100" name="RC8"/>
            <bitfield mask="0x00000200" name="RC9"/>
            <bitfield mask="0x00000400" name="RC10"/>
            <bitfield mask="0x00000800" name="RC11"/>
            <bitfield mask="0x00001000" name="RC12"/>
            <bitfield mask="0x00002000" name="RC13"/>
            <bitfield mask="0x00004000" name="RC14"/>
            <bitfield mask="0x00008000" name="RC15"/>
         </register>
         <register caption="" name="PORTD" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RD0"/>
            <bitfield mask="0x00000002" name="RD1"/>
            <bitfield mask="0x00000004" name="RD2"/>
            <bitfield mask="0x00000008" name="RD3"/>
            <bitfield mask="0x00000010" name="RD4"/>
            <bitfield mask="0x00000020" name="RD5"/>
            <bitfield mask="0x00000040" name="RD6"/>
            <bitfield mask="0x00000080" name="RD7"/>
            <bitfield mask="0x00000100" name="RD8"/>
            <bitfield mask="0x00000200" name="RD9"/>
            <bitfield mask="0x00000400" name="RD10"/>
            <bitfield mask="0x00000800" name="RD11"/>
            <bitfield mask="0x00001000" name="RD12"/>
            <bitfield mask="0x00002000" name="RD13"/>
            <bitfield mask="0x00004000" name="RD14"/>
            <bitfield mask="0x00008000" name="RD15"/>
         </register>
         <register caption="" name="PORTE" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RE0"/>
            <bitfield mask="0x00000002" name="RE1"/>
            <bitfield mask="0x00000004" name="RE2"/>
            <bitfield mask="0x00000008" name="RE3"/>
            <bitfield mask="0x00000010" name="RE4"/>
            <bitfield mask="0x00000020" name="RE5"/>
            <bitfield mask="0x00000040" name="RE6"/>
            <bitfield mask="0x00000080" name="RE7"/>
            <bitfield mask="0x00000100" name="RE8"/>
            <bitfield mask="0x00000200" name="RE9"/>
            <bitfield mask="0x00000400" name="RE10"/>
            <bitfield mask="0x00000800" name="RE11"/>
            <bitfield mask="0x00001000" name="RE12"/>
            <bitfield mask="0x00002000" name="RE13"/>
            <bitfield mask="0x00004000" name="RE14"/>
            <bitfield mask="0x00008000" name="RE15"/>
         </register>
         <register caption="" name="PORTF" offset="0x520" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RF0"/>
            <bitfield mask="0x00000002" name="RF1"/>
            <bitfield mask="0x00000004" name="RF2"/>
            <bitfield mask="0x00000008" name="RF3"/>
            <bitfield mask="0x00000010" name="RF4"/>
            <bitfield mask="0x00000020" name="RF5"/>
            <bitfield mask="0x00000040" name="RF6"/>
            <bitfield mask="0x00000080" name="RF7"/>
            <bitfield mask="0x00000100" name="RF8"/>
            <bitfield mask="0x00000200" name="RF9"/>
            <bitfield mask="0x00000400" name="RF10"/>
            <bitfield mask="0x00000800" name="RF11"/>
            <bitfield mask="0x00001000" name="RF12"/>
            <bitfield mask="0x00002000" name="RF13"/>
            <bitfield mask="0x00004000" name="RF14"/>
            <bitfield mask="0x00008000" name="RF15"/>
         </register>
         <register caption="" name="PORTG" offset="0x620" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RG0"/>
            <bitfield mask="0x00000002" name="RG1"/>
            <bitfield mask="0x00000004" name="RG2"/>
            <bitfield mask="0x00000008" name="RG3"/>
            <bitfield mask="0x00000010" name="RG4"/>
            <bitfield mask="0x00000020" name="RG5"/>
            <bitfield mask="0x00000040" name="RG6"/>
            <bitfield mask="0x00000080" name="RG7"/>
            <bitfield mask="0x00000100" name="RG8"/>
            <bitfield mask="0x00000200" name="RG9"/>
            <bitfield mask="0x00000400" name="RG10"/>
            <bitfield mask="0x00000800" name="RG11"/>
            <bitfield mask="0x00001000" name="RG12"/>
            <bitfield mask="0x00002000" name="RG13"/>
            <bitfield mask="0x00004000" name="RG14"/>
            <bitfield mask="0x00008000" name="RG15"/>
         </register>
         <register caption="" name="LATA" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATA0"/>
            <bitfield mask="0x00000002" name="LATA1"/>
            <bitfield mask="0x00000004" name="LATA2"/>
            <bitfield mask="0x00000008" name="LATA3"/>
            <bitfield mask="0x00000010" name="LATA4"/>
            <bitfield mask="0x00000020" name="LATA5"/>
            <bitfield mask="0x00000040" name="LATA6"/>
            <bitfield mask="0x00000080" name="LATA7"/>
            <bitfield mask="0x00000100" name="LATA8"/>
            <bitfield mask="0x00000200" name="LATA9"/>
            <bitfield mask="0x00000400" name="LATA10"/>
            <bitfield mask="0x00000800" name="LATA11"/>
            <bitfield mask="0x00001000" name="LATA12"/>
            <bitfield mask="0x00002000" name="LATA13"/>
            <bitfield mask="0x00004000" name="LATA14"/>
            <bitfield mask="0x00008000" name="LATA15"/>
         </register>
         <register caption="" name="LATB" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATB0"/>
            <bitfield mask="0x00000002" name="LATB1"/>
            <bitfield mask="0x00000004" name="LATB2"/>
            <bitfield mask="0x00000008" name="LATB3"/>
            <bitfield mask="0x00000010" name="LATB4"/>
            <bitfield mask="0x00000020" name="LATB5"/>
            <bitfield mask="0x00000040" name="LATB6"/>
            <bitfield mask="0x00000080" name="LATB7"/>
            <bitfield mask="0x00000100" name="LATB8"/>
            <bitfield mask="0x00000200" name="LATB9"/>
            <bitfield mask="0x00000400" name="LATB10"/>
            <bitfield mask="0x00000800" name="LATB11"/>
            <bitfield mask="0x00001000" name="LATB12"/>
            <bitfield mask="0x00002000" name="LATB13"/>
            <bitfield mask="0x00004000" name="LATB14"/>
            <bitfield mask="0x00008000" name="LATB15"/>
         </register>
         <register caption="" name="LATC" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATC0"/>
            <bitfield mask="0x00000002" name="LATC1"/>
            <bitfield mask="0x00000004" name="LATC2"/>
            <bitfield mask="0x00000008" name="LATC3"/>
            <bitfield mask="0x00000010" name="LATC4"/>
            <bitfield mask="0x00000020" name="LATC5"/>
            <bitfield mask="0x00000040" name="LATC6"/>
            <bitfield mask="0x00000080" name="LATC7"/>
            <bitfield mask="0x00000100" name="LATC8"/>
            <bitfield mask="0x00000200" name="LATC9"/>
            <bitfield mask="0x00000400" name="LATC10"/>
            <bitfield mask="0x00000800" name="LATC11"/>
            <bitfield mask="0x00001000" name="LATC12"/>
            <bitfield mask="0x00002000" name="LATC13"/>
            <bitfield mask="0x00004000" name="LATC14"/>
            <bitfield mask="0x00008000" name="LATC15"/>
         </register>
         <register caption="" name="LATD" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATD0"/>
            <bitfield mask="0x00000002" name="LATD1"/>
            <bitfield mask="0x00000004" name="LATD2"/>
            <bitfield mask="0x00000008" name="LATD3"/>
            <bitfield mask="0x00000010" name="LATD4"/>
            <bitfield mask="0x00000020" name="LATD5"/>
            <bitfield mask="0x00000040" name="LATD6"/>
            <bitfield mask="0x00000080" name="LATD7"/>
            <bitfield mask="0x00000100" name="LATD8"/>
            <bitfield mask="0x00000200" name="LATD9"/>
            <bitfield mask="0x00000400" name="LATD10"/>
            <bitfield mask="0x00000800" name="LATD11"/>
            <bitfield mask="0x00001000" name="LATD12"/>
            <bitfield mask="0x00002000" name="LATD13"/>
            <bitfield mask="0x00004000" name="LATD14"/>
            <bitfield mask="0x00008000" name="LATD15"/>
         </register>
         <register caption="" name="LATE" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATE0"/>
            <bitfield mask="0x00000002" name="LATE1"/>
            <bitfield mask="0x00000004" name="LATE2"/>
            <bitfield mask="0x00000008" name="LATE3"/>
            <bitfield mask="0x00000010" name="LATE4"/>
            <bitfield mask="0x00000020" name="LATE5"/>
            <bitfield mask="0x00000040" name="LATE6"/>
            <bitfield mask="0x00000080" name="LATE7"/>
            <bitfield mask="0x00000100" name="LATE8"/>
            <bitfield mask="0x00000200" name="LATE9"/>
            <bitfield mask="0x00000400" name="LATE10"/>
            <bitfield mask="0x00000800" name="LATE11"/>
            <bitfield mask="0x00001000" name="LATE12"/>
            <bitfield mask="0x00002000" name="LATE13"/>
            <bitfield mask="0x00004000" name="LATE14"/>
            <bitfield mask="0x00008000" name="LATE15"/>
         </register>
