Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ0512EFF100.atdf
         <register caption="True Random Number Generator Seed Register x (x = 1 or 2" name="RNGSEED2" offset="0x1c" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="SEED"/>
         </register>
         <register caption="True Random Number Generator Count Register" name="RNGCNT" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="RCNT"/>
         </register>
      </register-group>
      <value-group caption="TRNG Operation Enable bit" name="RNGCON__TRNGEN">
         <value caption="TRNG operation is enabled" name="" value="0x1"/>
         <value caption="TRNG operation is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="PRNG Operation Enable bit" name="RNGCON__PRNGEN">
         <value caption="PRNG operation is enabled" name="" value="0x1"/>
         <value caption="PRNG operation is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="PRNG Number Shift Enable bit" name="RNGCON__CONT">
         <value caption="The PRNG random number is shifted every cycle" name="" value="0x1"/>
         <value caption="The PRNG random number is shifted when the previous value is removed" name="" value="0x0"/>
      </value-group>
      <value-group caption="TRNG Mode Selection bit" name="RNGCON__TRNGMODE">
         <value caption="Use ring oscillators with bias corrector" name="" value="0x1"/>
         <value caption="Use ring oscillators with XOR tree" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="01423" name="RPIN" version="">
      <register-group name="RPIN">
         <register caption="" name="INT1R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT1R"/>
         </register>
         <register caption="" name="INT2R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT2R"/>
         </register>
         <register caption="" name="INT3R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT3R"/>
         </register>
         <register caption="" name="INT4R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT4R"/>
         </register>
         <register caption="" name="T2CKR" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T2CKR"/>
         </register>
         <register caption="" name="T3CKR" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T3CKR"/>
         </register>
         <register caption="" name="T4CKR" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T4CKR"/>
         </register>
         <register caption="" name="T5CKR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T5CKR"/>
         </register>
         <register caption="" name="T6CKR" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T6CKR"/>
         </register>
         <register caption="" name="T7CKR" offset="0x28" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T7CKR"/>
         </register>
         <register caption="" name="T8CKR" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T8CKR"/>
         </register>
         <register caption="" name="T9CKR" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T9CKR"/>
         </register>
         <register caption="" name="IC1R" offset="0x34" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC1R"/>
         </register>
         <register caption="" name="IC2R" offset="0x38" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC2R"/>
         </register>
         <register caption="" name="IC3R" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC3R"/>
         </register>
         <register caption="" name="IC4R" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC4R"/>
         </register>
         <register caption="" name="IC5R" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC5R"/>
         </register>
         <register caption="" name="IC6R" offset="0x48" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC6R"/>
         </register>
         <register caption="" name="IC7R" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC7R"/>
         </register>
         <register caption="" name="IC8R" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC8R"/>
         </register>
         <register caption="" name="IC9R" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC9R"/>
         </register>
         <register caption="" name="OCFAR" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="OCFAR"/>
         </register>
         <register caption="" name="U1RXR" offset="0x64" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U1RXR"/>
         </register>
         <register caption="" name="U1CTSR" offset="0x68" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U1CTSR"/>
         </register>
         <register caption="" name="U2RXR" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U2RXR"/>
         </register>
         <register caption="" name="U2CTSR" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U2CTSR"/>
         </register>
         <register caption="" name="U3RXR" offset="0x74" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U3RXR"/>
         </register>
         <register caption="" name="U3CTSR" offset="0x78" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U3CTSR"/>
         </register>
         <register caption="" name="U4RXR" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U4RXR"/>
         </register>
         <register caption="" name="U4CTSR" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U4CTSR"/>
         </register>
         <register caption="" name="U5RXR" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U5RXR"/>
         </register>
         <register caption="" name="U5CTSR" offset="0x88" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U5CTSR"/>
         </register>
         <register caption="" name="U6RXR" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U6RXR"/>
         </register>
